In [1]:
# -q (quiet) 옵션은 설치 로그를 안보여줌(조용히함)
%pip install -q seaborn

Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [ ]:
# CSV 파일로 저장
titanic.to_csv("titanic_data.csv", index=False)

In [18]:
# 타이타닉 데이터셋 불러오기
# (pandas에 기본 내장된 예제 데이터셋)
import seaborn as sns

# titanic 데이터 DataFrame
titanic = sns.load_dataset('titanic')

# 처음 5개 행 보기
print("타이타닉 데이터 미리보기:")
print(titanic.head())

# 데이터셋 정보 확인
print("\n데이터셋 정보:")
print(titanic.info())

# 데이터 요약 통계
print("\n데이터 요약 통계:")
print(titanic.describe())

타이타닉 데이터 미리보기:
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

데이터셋 정보:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
None

데이터 요약 통계:
         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [ ]:
# Col 결측치 합계
print(titanic.isnull().sum()) 
# 승객 등급 등장 빈도 (1, 2, 3 등석)
print(titanic['pclass'].value_counts().sort_index())
# 성별 진도 (남/녀)
print(titanic['sex'].value_counts().sort_index())
# 생존 여부 빈도 (생존율 / 사망자)
print(titanic['survived'].value_counts().sort_index())  # 사망 = 0, 생존 = 1

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64
pclass
1    216
2    184
3    491
Name: count, dtype: int64
sex
female    314
male      577
Name: count, dtype: int64
survived
0    549
1    342
Name: count, dtype: int64

In [23]:
# 성별에 다른 생존율
survival_by_sex = titanic.groupby('sex')['survived'].mean()
print(survival_by_sex)
# 승객 등급에 따른 생존율
survival_by_class = titanic.groupby('pclass')['survived'].mean().sort_index()
print(survival_by_class)

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64
pclass
1    0.629630
2    0.472826
3    0.242363
Name: survived, dtype: float64

In [26]:
# 성별 & 승객 등급에 따른 생존
survival_by_sex_class = titanic.groupby(['sex', 'pclass'])['survived'].mean()
print(survival_by_sex_class)
# 나이 그룹별 생존율
bins = [0, 10, 20, 30, 40, 50, 60, 70, 80]
labels = ['0-10','11-20','21-30','31-40','41-50','51-60','61-70','71-80']
titanic['age_group'] = pd.cut(titanic['age'], bins=bins, labels=labels, right=False)  # 나이 구간 설정

survival_by_age_group = titanic.groupby('age_group')['survived'].mean()
print(survival_by_age_group)

sex     pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: survived, dtype: float64
age_group
0-10     0.612903
11-20    0.401961
21-30    0.350000
31-40    0.437126
41-50    0.382022
51-60    0.416667
61-70    0.315789
71-80    0.000000
Name: survived, dtype: float64

C:\Users\trueb\AppData\Local\Temp\ipykernel_348\2627091270.py:9: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  survival_by_age_group = titanic.groupby('age_group')['survived'].mean()

In [ ]:
# 혼자 탑승했는지 여부 - True면 혼자 탑승, False면 가족과 함께 탑승
print(titanic['alone'].value_counts())
# embark_town - 탑승지 이름
print(titanic['embark_town'].value_counts())
# sibsp - 함께 탑승한 형제 및 배우자 수
print(titanic['sibsp'].value_counts().sort_index())
# parch - 함께 탑승한 자녀 및 부모 수
print(titanic['parch'].value_counts().sort_index())  # 0 = 부모 및 자녀 없이 탑승 / 1 = 부모 또는 자녀 1명과 동행 외
# embarked - 탑승지 이름 앞글자
print(titanic['embarked'].value_counts())
# deck - 선실 번호 첫 알파벳
print(titanic['deck'].value_counts().sort_index())
# 등등. 유명한 Data 이기 때문에 데이터를 LLM에 입력시키지 않아도 찾을 수 있지만 값이 변할 수도 있기에 csv 파일로 다운 받아 LLM에 입력해서 추출

alone
True     537
False    354
Name: count, dtype: int64
embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64
sibsp
0    608
1    209
2     28
3     16
4     18
5      5
8      7
Name: count, dtype: int64
parch
0    678
1    118
2     80
3      5
4      4
5      5
6      1
Name: count, dtype: int64
embarked
S    644
C    168
Q     77
Name: count, dtype: int64
deck
A    15
B    47
C    59
D    33
E    32
F    13
G     4
Name: count, dtype: int64

In [61]:
titanic = sns.load_dataset('titanic')
# 결측치 확인
missing = titanic.isna().sum()
# 결측 있는 항목만 확인
missing[missing > 0]

# 결측 비율
missing_p = titanic.isna().mean() * 100
missing_p[missing_p > 0]

age            19.865320
embarked        0.224467
deck           77.216611
embark_town     0.224467
dtype: float64

In [60]:
# 결측치 채우기
# age: 중요한 정보 : 평균/중앙값 대체
# embarked: 가장 많은 사람들이 탄 곳으로 대체
# deck: 추측 불가능(의믹 없음) -> 삭제

# 필요하다면, 카피떠서 진행
titanic_processed = titanic.copy()

# 비어있던 행 마스킹
age_mask =titanic['age'].isna()

# 나이 결측치 채우기 (남녀상관없이 전체평균으로 채움)
mean_age = titanic['age'].mean()
titanic_processed['age'] = titanic['age'].fillna(mean_age)

# 결측치 있는지 재확인
titanic_processed.isna().sum()

# 평균으로 채워진 값들만 확인
titanic_processed.loc[age_mask]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,29.699118,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
17,1,2,male,29.699118,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
19,1,3,female,29.699118,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,29.699118,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
28,1,3,female,29.699118,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,29.699118,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,29.699118,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,29.699118,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,29.699118,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [59]:
# 전체 평균으로 대체하는게 옯을까?
# 성별/객실별로 평균을 추전하는건?

# 모든 사람들을 성별/객실 그룹의 평균 나이로 바꾼 Serise
titanic.groupby(['sex', 'pclass'])['age'].transform('mean')

# 타이타닉의 age col 중 빈 값만 mean_age로 채움
titanic_processed['age'] = titanic['age'].fillna(mean_age)

titanic_processed.loc[titanic['age'].isna()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,29.699118,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
17,1,2,male,29.699118,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
19,1,3,female,29.699118,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,29.699118,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
28,1,3,female,29.699118,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,29.699118,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,29.699118,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,29.699118,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,29.699118,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False